903257958/stm32_oop_driver/mpu6050_i2c_sw/driver/uart.c
	priv_data->index = __uart_get_index(dev->info.uartx);

	/* 配置时钟与GPIO */
	__uart_config_clock_enable(dev->info.uartx);
	__uart_config_gpio_clock_enable(dev->info.tx_port);
	__uart_config_gpio_clock_enable(dev->info.rx_port);
	__uart_config_io_af_pp(dev->info.tx_port, dev->info.tx_pin);
	__uart_config_io_af_pp(dev->info.rx_port, dev->info.rx_pin);
	
	#if defined(STM32F40_41xxx) || defined(STM32F411xE)
	if (dev->info.uartx == USART1)
	{
		GPIO_PinAFConfig(GPIOA, GPIO_PinSource9, GPIO_AF_USART1);
		GPIO_PinAFConfig(GPIOA, GPIO_PinSource10, GPIO_AF_USART1);
	}
	else if (dev->info.uartx == USART2)
	{
		GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_USART2);
		GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_USART2);
	}
	else if (dev->info.uartx == USART2)
	{
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource10, GPIO_AF_USART3);
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource11, GPIO_AF_USART3);
	}
	else if (dev->info.uartx == UART4)
	{
		GPIO_PinAFConfig(GPIOC, GPIO_PinSource10, GPIO_AF_UART4);
		GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_UART4);
	}
	else if (dev->info.uartx == UART5)
	{
		GPIO_PinAFConfig(GPIOC, GPIO_PinSource12, GPIO_AF_UART5);
		GPIO_PinAFConfig(GPIOD, GPIO_PinSource2, GPIO_AF_UART5);
	}
	else if (dev->info.uartx == USART6)
	{
		GPIO_PinAFConfig(GPIOC, GPIO_PinSource6, GPIO_AF_USART6);
		GPIO_PinAFConfig(GPIOC, GPIO_PinSource7, GPIO_AF_USART6);
	}
	#endif
	
	/* 配置USART */
	USART_InitTypeDef USART_InitStructure;
	USART_InitStructure.USART_BaudRate = dev->info.baud;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_Init(dev->info.uartx, &USART_InitStructure);
	
	/* 配置中断 */
	USART_ITConfig(dev->info.uartx, USART_IT_RXNE, ENABLE);
	
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = __uart_get_irqn(dev->info.uartx);
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_Init(&NVIC_InitStructure);
	
	/* 开启USART */
	USART_Cmd(dev->info.uartx, ENABLE);
	
	/* 函数指针赋值 */
	dev->send_byte = __uart_send_byte;
	dev->send_array = __uart_send_array;
	dev->send_string = __uart_send_string;
	dev->send_number = __uart_send_number;
	dev->send_hex_packet = __uart_send_hex_packet;
	dev->printf = __uart_printf;
	dev->recv_string = __uart_recv_string;
	dev->recv_string_flag = __uart_recv_string_flag;
	dev->deinit = __uart_deinit;
	
	dev->dma_Flag = false;
	dev->init_flag = true;
	return 0;
}

/******************************************************************************
 * @brief	初始化UART并配置为DMA接收数据
 * @param	dev	:  UARTDev_t结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/											
int uart_dma_init(UARTDev_t *dev)
{
	/* UART初始化 */
	uart_init(dev);
	
	/* 保存私有数据 */
	UARTPrivData_t *priv_data = (UARTPrivData_t *)dev->priv_data;
	
	#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
	
	if (dev->info.uartx == USART1)			{	priv_data->DMAChannel = DMA1_Channel5;	}
	else if (dev->info.uartx == USART2)	{	priv_data->DMAChannel = DMA1_Channel6;	}
	else if (dev->info.uartx == USART3)	{	priv_data->DMAChannel = DMA1_Channel3;	}
	else if (dev->info.uartx == UART4)		{	priv_data->DMAChannel = DMA2_Channel3;	}
	else	{return -1;}

	/* 配置DMA */
	__uart_config_dma_clock_enable(dev->info.uartx);
	DMA_InitTypeDef DMA_InitStructure;
	DMA_DeInit(priv_data->DMAChannel);													// 将DMA的通道寄存器重设为缺省值
	DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&dev->info.uartx->DR;		// DMA外设基地址
	DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)(g_rx_str[priv_data->index]);		// DMA内存基地址
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;									// 数据传输方向，从外设读取发送到内存
	DMA_InitStructure.DMA_BufferSize = sizeof(g_rx_str[priv_data->index]);				// DMA通道的DMA缓存的大小
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;					// 外设地址寄存器不变
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;								// 内存地址寄存器递增
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;				// 数据宽度为8位
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;						// 数据宽度为8位
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;										// 工作在正常模式，一次传输后自动结束
	DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;								// 中优先级 
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;										// 没有设置为内存到内存传输
	DMA_Init(priv_data->DMAChannel, &DMA_InitStructure);

	/* 中断使能 */
	USART_ITConfig(dev->info.uartx, USART_IT_RXNE, DISABLE);							// 关闭串口接受中断
	USART_ITConfig(dev->info.uartx, USART_IT_IDLE, ENABLE);								// 使能UART空闲中断

	/* 开启DMA */
	DMA_Cmd(priv_data->DMAChannel, ENABLE);

	/* 启用UART的DMA请求 */
	USART_DMACmd(dev->info.uartx, USART_DMAReq_Rx, ENABLE);

	#elif defined(STM32F40_41xxx) || defined(STM32F411xE)
	
	/* 配置DMA */
	__uart_config_dma_clock_enable(dev->info.uartx);									// 开启DMA时钟
	DMA_DeInit(__uart_get_dma_stream(dev->info.uartx));
	DMA_InitTypeDef DMA_InitStructure;
    DMA_InitStructure.DMA_Channel = __uart_get_dma_channel(dev->info.uartx);			// 选择DMA通道
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&dev->info.uartx->DR;			// DMA外设基地址
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)(g_rx_str[priv_data->index]);		// DMA内存基地址
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;								// 从外设读取发送到内存
    DMA_InitStructure.DMA_BufferSize = sizeof(g_rx_str[priv_data->index]);				// DMA通道的DMA缓存的大小
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;					// 外设地址不增
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;								// 内存地址自增
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;				// 外设数据单位8位
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;						// 内存数据单位8位
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;										// 工作在正常模式，一次传输后自动结束
    DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;								// 优先级：中
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;								// 禁用FIFO模式
    DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;						// FIFO阈值为满
    DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;							// 内存突发传输为单次
    DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;					// 外设突发传输为单次
    DMA_Init(__uart_get_dma_stream(dev->info.uartx), &DMA_InitStructure);
					
	/* 中断使能 */
	USART_ITConfig(dev->info.uartx, USART_IT_RXNE, DISABLE);							// 关闭串口接受中断
	USART_ITConfig(dev->info.uartx, USART_IT_IDLE, ENABLE);								// 使能UART空闲中断

	/* 开启DMA */
    DMA_Cmd(__uart_get_dma_stream(dev->info.uartx), ENABLE);

	/* 启用UART的DMA请求 */
	USART_DMACmd(dev->info.uartx, USART_DMAReq_Rx, ENABLE);
	
	#endif
	
	/* 函数指针赋值 */
	dev->dma_recv_enable = __uart_dma_recv_enable;
	
	dev->dma_Flag = true;
	
