903257958/stm32_oop_driver/mpu6050_i2c_sw/driver/uart.c
	return 0;
}

/******************************************************************************
 * @brief	UART开启一次DMA接收
 * @param	dev	:  UARTDev_t 结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __uart_dma_recv_enable(UARTDev_t *dev)
{
	UARTPrivData_t *priv_data = (UARTPrivData_t *)dev->priv_data;
	
	if (!dev || !dev->init_flag || !dev->dma_Flag)
		return -1;
	
	#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
	
	/* 将接收的内存部分数据清0 */
	memset(g_rx_str[priv_data->index], 0, sizeof(g_rx_str[priv_data->index]));
	
	/* 重新设置传输数据长度 */
	DMA_SetCurrDataCounter(priv_data->DMAChannel, sizeof(g_rx_str[priv_data->index]));

	/* 重新打开DMA */
	DMA_Cmd(priv_data->DMAChannel, ENABLE);
	
	#elif defined(STM32F40_41xxx) || defined(STM32F411xE)
	
	/* 将接收的内存部分数据清0 */
	memset(g_rx_str[priv_data->index], 0, sizeof(g_rx_str[priv_data->index]));

	/* 清除标志位 */
	DMA_ClearFlag(__uart_get_dma_stream(dev->info.uartx), __uart_get_dma_flag(dev->info.uartx));
	USART_ClearFlag(dev->info.uartx, USART_FLAG_IDLE);

	/* 重新设置传输数据长度 */
	DMA_SetCurrDataCounter(__uart_get_dma_stream(dev->info.uartx), sizeof(g_rx_str[priv_data->index]));

	/* 重新打开DMA */
	DMA_Cmd(__uart_get_dma_stream(dev->info.uartx), ENABLE);
	
	#endif

	return 0;
}

/******************************************************************************
 * @brief	UART发送一个字节
 * @param	dev	:  UARTDev_t 结构体指针
 * @param	byte	:  要发送的字节
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/	
static int __uart_send_byte(UARTDev_t *dev, uint8_t byte)
{
	if (!dev || !dev->init_flag)
		return -1;
	
	USART_SendData(dev->info.uartx, byte);	// 写DR寄存器
	while (RESET == USART_GetFlagStatus(dev->info.uartx, USART_FLAG_TXE));	// 等待TXE置1，不需要手动清除标志位
	
	return 0;
}

/******************************************************************************
 * @brief	UART发送一个数组
 * @param	dev	:  UARTDev_t 结构体指针
 * @param	array	:  要发送的数组首地址
 * @param	length	:  要发送的数组长度
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __uart_send_array(UARTDev_t *dev, uint8_t *array, uint16_t length)
{
	if (!dev || !dev->init_flag)
		return -1;
	
	while (length--)
    {
        __uart_send_byte(dev, *array++);
    }
	
	return 0;
}

/******************************************************************************
 * @brief	UART发送一个字符串
 * @param	dev	:  UARTDev_t 结构体指针
 * @param	str		:  要发送的字符串首地址
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __uart_send_string(UARTDev_t *dev, char *str)
{
	if (!dev || !dev->init_flag)
		return -1;
	
	while (*str != '\0')
	{
		__uart_send_byte(dev, *str++);
	}
	
	return 0;
}

/******************************************************************************
 * @brief	次方函数
 * @param	x
 * @param	y
 * @return	x^y
 ******************************************************************************/
static uint32_t pow(uint32_t x, uint8_t y)
{
	uint32_t res = 1;
	while (y--)
	{
		res *= x;
	}
	return res;
}

/******************************************************************************
 * @brief	UART发送一个数字
 * @param	dev	:  UARTDev_t 结构体指针
 * @param	num		:  要发送的数字
 * @param	length	:  要发送的数字长度
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __uart_send_number(UARTDev_t *dev, uint32_t num, uint8_t length)
{
	if (!dev || !dev->init_flag)
		return -1;
	
	uint8_t i;
	for(i = 0;i < length;i++)
	{
		__uart_send_byte(dev, num / pow(10, length - i - 1) % 10 + '0');
	}
	
	return 0;
}

/******************************************************************************
 * @brief	UART发送HEX数据包
 * @param	dev	:  UARTDev_t 结构体指针
 * @param	packet	:  要发送的HEX数据包首地址
 * @param	length	:  要发送的HEX数据包长度
 * @param	packet	:  要发送的HEX数据包头
 * @param	length	:  要发送的HEX数据包尾
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __uart_send_hex_packet(UARTDev_t *dev, uint8_t *packet, uint8_t length, uint8_t head, uint8_t end)
{
	if (!dev || !dev->init_flag)
		return -1;
	
	__uart_send_byte(dev, head);	//发送包头
	__uart_send_array(dev, packet, length);	//发送数据包
	__uart_send_byte(dev, end);	//发送包尾
	
	return 0;
}

/******************************************************************************
 * @brief	printf重定义（仅UART1可用）
 ******************************************************************************/
int fputc(int ch, FILE *f)
{
	USART_SendData(USART1, ch);	// 写DR寄存器
	while (RESET == USART_GetFlagStatus(USART1, USART_FLAG_TXE));	// 等待TXE置1，不需要手动清除标志位
	return ch;
}

/******************************************************************************
 * @brief	printf函数封装（多个串口都可使用）
 * @param	dev	:  UARTDev_t 结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __uart_printf(UARTDev_t *dev, char *format, ...)
{
	if (!dev || !dev->init_flag)
		return -1;
	
	char str[100];
	va_list arg;
	va_start(arg, format);
	vsprintf(str, format, arg);
	va_end(arg);
	__uart_send_string(dev, str);
	
	return 0;
}

/******************************************************************************
 * @brief	返回UART接收的文本数据包的首地址
 * @param	dev	:  UARTDev_t 结构体指针
 * @return	UART接收的文本数据包的首地址
 ******************************************************************************/
static char *__uart_recv_string(UARTDev_t *dev)
{
	UARTPrivData_t *priv_data = dev->priv_data;
	
	return g_rx_str[priv_data->index];
}

/******************************************************************************
 * @brief	返回UART接收的文本数据包标志位（并自动清除）
 * @param	dev	:  UARTDev_t 结构体指针
 * @return	UART接收的文本数据包标志位
 ******************************************************************************/
static uint8_t __uart_recv_string_flag(UARTDev_t *dev)
{
	UARTPrivData_t *priv_data = dev->priv_data;
	
	if (g_rx_str_flag[priv_data->index] == 1)
	{
		g_rx_str_flag[priv_data->index] = 0;
		
		return 1;
	}
	return 0;
}

